In [2]:
import pandas as pd
df=pd.DataFrame(
    {
        'city':['New York','London','Paris','Tokyo','New York','Paris'],
        'Price':[100,200,300,150,140,340]
    }
)

In [3]:
df

       city  Price
0  New York    100
1    London    200
2     Paris    300
3     Tokyo    150
4  New York    140
5     Paris    340

In [ ]:
## Calculating the mean of the categorical variable from the target variable

mean_price=df.groupby('city')['Price'].mean()

In [5]:
mean_price

city
London      200.0
New York    120.0
Paris       320.0
Tokyo       150.0
Name: Price, dtype: float64

In [6]:
df['mean_encoded']=df['city'].map(mean_price)

In [7]:
df

       city  Price  mean_encoded
0  New York    100         120.0
1    London    200         200.0
2     Paris    300         320.0
3     Tokyo    150         150.0
4  New York    140         120.0
5     Paris    340         320.0

In [9]:
df[['Price','mean_encoded']]

   Price  mean_encoded
0    100         120.0
1    200         200.0
2    300         320.0
3    150         150.0
4    140         120.0
5    340         320.0